app/Controllers/users.php

    public function index()
    {
        $user = new User();
        $datos['user'] = $user->orderBy('id_usuario','ASC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `id_usuario` ASC